Hi @dhenry-ceetiz you can use the new terraform pattern `for_each` to achieve this:
```hcl
provider "scaleway" {
  region  = "fr-par"
  zone    = "fr-par-1"
  version = "~> 1.11"
}

locals {
  trusted = ["192.168.0.1", "192.168.0.2"]
}

resource "scaleway_instance_security_group" "dummy" {
  inbound_default_policy  = "drop"
  outbound_default_policy = "accept"
  
  dynamic "inbound_rule" {
    for_each = local.trusted

    content {
      action = "accept"
      port   = 22
      ip     = inbound_rule.value
    }
  }
}
```


It works fine for me:
```
➜  terraform plan

...

Terraform will perform the following actions:

  # scaleway_instance_security_group.dummy will be created
  + resource "scaleway_instance_security_group" "dummy" {
      + id                      = (known after apply)
      + inbound_default_policy  = "drop"
      + name                    = (known after apply)
      + organization_id         = (known after apply)
      + outbound_default_policy = "accept"
      + zone                    = (known after apply)

      + inbound_rule {
          + action     = "accept"
          + ip         = "192.168.0.1"
          + port       = 22
          + port_range = (known after apply)
          + protocol   = "TCP"
        }
      + inbound_rule {
          + action     = "accept"
          + ip         = "192.168.0.2"
          + port       = 22
          + port_range = (known after apply)
          + protocol   = "TCP"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

...

➜  terraform version
Terraform v0.12.10
+ provider.scaleway v1.11.0
```

Let me know is this solve your issue.